/**
 * @author DuYing
 * @homepage https://github.com/Dale-/
 * @since 12/23/16
 */

export const INPUT = {
	province: '辽宁省',
	city: '沈阳市',
	district: '沈河区'
};

export const CITYS =
	[{id: '210000', citys: [
		{id: '210100', name: '沈阳市'},
		{id: '210200', name: '大连市'},
		{id: '210300', name: '鞍山市'},
		{id: '210400', name: '抚顺市'},
		{id: '210500', name: '本溪市'},
		{id: '210600', name: '丹东市'},
		{id: '210700', name: '锦州市'},
		{id: '210800', name: '营口市'},
		{id: '210900', name: '阜新市'},
		{id: '211000', name: '辽阳市'},
		{id: '211100', name: '盘锦市'},
		{id: '211200', name: '铁岭市'},
		{id: '211300', name: '朝阳市'},
		{id: '211400', name: '葫芦岛市'}
	]},
	{id: '610000', citys: [
		{id: '610100', name: '西安市'},
		{id: '610200', name: '铜川市'},
		{id: '610300', name: '宝鸡市'},
		{id: '610400', name: '咸阳市'},
		{id: '610500', name: '渭南市'},
		{id: '610600', name: '延安市'},
		{id: '610700', name: '汉中市'},
		{id: '610800', name: '榆林市'},
		{id: '610900', name: '安康市'},
		{id: '611000', name: '商洛市'}
	]},
	{id: '320000', citys: [
		{id: '320100', name: '南京市'},
		{id: '320200', name: '无锡市'},
		{id: '320300', name: '徐州市'},
		{id: '320400', name: '常州市'},
		{id: '320500', name: '苏州市'},
		{id: '320600', name: '南通市'},
		{id: '320700', name: '连云港市'},
		{id: '320800', name: '淮安市'},
		{id: '320900', name: '盐城市'},
		{id: '321000', name: '扬州市'},
		{id: '321100', name: '镇江市'},
		{id: '321200', name: '泰州市'},
		{id: '321300', name: '泰州市'}
	]}];

export const PROVINCES = [
	{id: '210000', name: '辽宁省'},
	{id: '610000', name: '陕西省'},
	{id: '320000', name: '江苏省'}];

export const DISTRICTS =
	[{id: '210100', districts: [
		{id: '210101', name: '市辖区'},
		{id: '210102', name: '和平区'},
		{id: '210103', name: '沈河区'},
		{id: '210104', name: '大东区'},
		{id: '210105', name: '皇姑区'},
		{id: '210106', name: '铁西区'},
		{id: '210111', name: '苏家屯区'},
		{id: '210112', name: '东陵区'},
		{id: '210113', name: '新城子区'},
		{id: '210114', name: '于洪区'},
		{id: '210122', name: '辽中县'},
		{id: '210123', name: '康平县'},
		{id: '210124', name: '法库县'},
		{id: '210181', name: '新民市'}]},
	{id: '210200', districts: [
		{id: '210201', name: '市辖区'},
		{id: '210202', name: '中山区'},
		{id: '210203', name: '西岗区'},
		{id: '210204', name: '沙河口区'},
		{id: '210211', name: '甘井子区'},
		{id: '210212', name: '旅顺口区'},
		{id: '210213', name: '金州区'},
		{id: '210224', name: '长海县'},
		{id: '210281', name: '瓦房店市'},
		{id: '210282', name: '普兰店市'},
		{id: '210283', name: '庄河市'}]},
	{id: '610100', districts: [
		{id: '610101', name: '市辖区'},
		{id: '610102', name: '新城区'},
		{id: '610103', name: '碑林区'},
		{id: '610104', name: '莲湖区'},
		{id: '610111', name: '灞桥区'},
		{id: '610112', name: '未央区'},
		{id: '610113', name: '雁塔区'},
		{id: '610114', name: '阎良区'},
		{id: '610115', name: '临潼区'},
		{id: '610116', name: '长安区'},
		{id: '610122', name: '蓝田县'},
		{id: '610124', name: '周至县'},
		{id: '610125', name: '户　县'},
		{id: '610126', name: '高陵县'}]}];

export const COMMON_AREAS = ['江浙沪', '珠三角', '京津翼', '东三省', '港澳台', '江浙沪皖'];
